Oryx-Embedded/CycloneCRYPTO/hardware/gd32f2xx/gd32f2xx_crypto_cipher.c
/**
 * @file gd32f2xx_crypto_cipher.c
 * @brief GD32F2 cipher hardware accelerator
 *
 * @section License
 *
 * SPDX-License-Identifier: GPL-2.0-or-later
 *
 * Copyright (C) 2010-2026 Oryx Embedded SARL. All rights reserved.
 *
 * This file is part of CycloneCRYPTO Open.
 *
 * This program is free software; you can redistribute it and/or
 * modify it under the terms of the GNU General Public License
 * as published by the Free Software Foundation; either version 2
 * of the License, or (at your option) any later version.
 *
 * This program is distributed in the hope that it will be useful,
 * but WITHOUT ANY WARRANTY; without even the implied warranty of
 * MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
 * GNU General Public License for more details.
 *
 * You should have received a copy of the GNU General Public License
 * along with this program; if not, write to the Free Software Foundation,
 * Inc., 51 Franklin Street, Fifth Floor, Boston, MA  02110-1301, USA.
 *
 * @author Oryx Embedded SARL (www.oryx-embedded.com)
 * @version 2.6.2
 **/

//Switch to the appropriate trace level
#define TRACE_LEVEL CRYPTO_TRACE_LEVEL

//Dependencies
#include "gd32f20x.h"
#include "gd32f20x_cau.h"
#include "core/crypto.h"
#include "hardware/gd32f2xx/gd32f2xx_crypto.h"
#include "hardware/gd32f2xx/gd32f2xx_crypto_cipher.h"
#include "cipher/cipher_algorithms.h"
#include "cipher_modes/cipher_modes.h"
#include "debug.h"

//Check crypto library configuration
#if (GD32F2XX_CRYPTO_CIPHER_SUPPORT == ENABLED)


/**
 * @brief CAU module initialization
 * @return Error code
 **/

error_t cauInit(void)
{
   //Enable CAU peripheral clock
   rcu_periph_clock_enable(RCU_CAU);

   //Successful processing
   return NO_ERROR;
}


#if (DES_SUPPORT == ENABLED)

/**
 * @brief Initialize a DES context using the supplied key
 * @param[in] context Pointer to the DES context to initialize
 * @param[in] key Pointer to the key
 * @param[in] keyLen Length of the key (must be set to 8)
 * @return Error code
 **/

error_t desInit(DesContext *context, const uint8_t *key, size_t keyLen)
{
   //Check parameters
   if(context == NULL || key == NULL)
      return ERROR_INVALID_PARAMETER;

   //Invalid key length?
   if(keyLen != 8)
      return ERROR_INVALID_KEY_LENGTH;

   //Copy the key
   osMemcpy(context->ks, key, keyLen);

   //No error to report
   return NO_ERROR;
}


/**
 * @brief Encrypt a 8-byte block using DES algorithm
 * @param[in] context Pointer to the DES context
 * @param[in] input Plaintext block to encrypt
 * @param[out] output Ciphertext block resulting from encryption
 **/

void desEncryptBlock(DesContext *context, const uint8_t *input, uint8_t *output)
{
   cau_text_struct text;

   //Specify input and output data
   text.input = (uint8_t *) input;
   text.output = output;
   text.in_length = DES_BLOCK_SIZE;

   //Acquire exclusive access to the CAU module
   osAcquireMutex(&gd32f2xxCryptoMutex);
   //Perform DES encryption
   cau_des_ecb(CAU_ENCRYPT, (uint8_t *) context->ks, &text);
   //Release exclusive access to the CAU module
   osReleaseMutex(&gd32f2xxCryptoMutex);
}


/**
 * @brief Decrypt a 8-byte block using DES algorithm
 * @param[in] context Pointer to the DES context
 * @param[in] input Ciphertext block to decrypt
 * @param[out] output Plaintext block resulting from decryption
 **/

void desDecryptBlock(DesContext *context, const uint8_t *input, uint8_t *output)
{
   cau_text_struct text;

   //Specify input and output data
   text.input = (uint8_t *) input;
   text.output = output;
   text.in_length = DES_BLOCK_SIZE;

   //Acquire exclusive access to the CAU module
   osAcquireMutex(&gd32f2xxCryptoMutex);
   //Perform DES decryption
   cau_des_ecb(CAU_DECRYPT, (uint8_t *) context->ks, &text);
   //Release exclusive access to the CAU module
   osReleaseMutex(&gd32f2xxCryptoMutex);
}

#endif
#if (DES3_SUPPORT == ENABLED)

/**
 * @brief Initialize a Triple DES context using the supplied key
 * @param[in] context Pointer to the Triple DES context to initialize
 * @param[in] key Pointer to the key
 * @param[in] keyLen Length of the key
 * @return Error code
 **/

error_t des3Init(Des3Context *context, const uint8_t *key, size_t keyLen)
{
   //Check parameters
   if(context == NULL || key == NULL)
      return ERROR_INVALID_PARAMETER;

   //Invalid key length?
   if(keyLen != 8 && keyLen != 16 && keyLen != 24)
      return ERROR_INVALID_KEY_LENGTH;

   //Copy the key
   osMemcpy(context->k1.ks, key, keyLen);

   //No error to report
   return NO_ERROR;
}


/**
 * @brief Encrypt a 8-byte block using Triple DES algorithm
 * @param[in] context Pointer to the Triple DES context
 * @param[in] input Plaintext block to encrypt
 * @param[out] output Ciphertext block resulting from encryption
 **/

void des3EncryptBlock(Des3Context *context, const uint8_t *input, uint8_t *output)
{
   cau_text_struct text;

   //Specify input and output data
   text.input = (uint8_t *) input;
   text.output = output;
   text.in_length = DES3_BLOCK_SIZE;

   //Acquire exclusive access to the CAU module
   osAcquireMutex(&gd32f2xxCryptoMutex);
   //Perform 3DES encryption
   cau_tdes_ecb(CAU_ENCRYPT, (uint8_t *) context->k1.ks, &text);
   //Release exclusive access to the CAU module
   osReleaseMutex(&gd32f2xxCryptoMutex);
}


/**
 * @brief Decrypt a 8-byte block using Triple DES algorithm
 * @param[in] context Pointer to the Triple DES context
 * @param[in] input Ciphertext block to decrypt
 * @param[out] output Plaintext block resulting from decryption
 **/

void des3DecryptBlock(Des3Context *context, const uint8_t *input, uint8_t *output)
{
   cau_text_struct text;

   //Specify input and output data
   text.input = (uint8_t *) input;
   text.output = output;
   text.in_length = DES3_BLOCK_SIZE;

   //Acquire exclusive access to the CAU module
   osAcquireMutex(&gd32f2xxCryptoMutex);
   //Perform 3DES decryption
   cau_tdes_ecb(CAU_DECRYPT, (uint8_t *) context->k1.ks, &text);
   //Release exclusive access to the CAU module
   osReleaseMutex(&gd32f2xxCryptoMutex);
}

#endif
#if (AES_SUPPORT == ENABLED)

/**
 * @brief Key expansion
 * @param[in] context Pointer to the AES context to initialize
 * @param[in] key Pointer to the key
 * @param[in] keyLen Length of the key
 * @return Error code
 **/

