Oryx-Embedded/CycloneCRYPTO/hardware/gd32f2xx/gd32f2xx_crypto_cipher.c
error_t aesInit(AesContext *context, const uint8_t *key, size_t keyLen)
{
   //Check parameters
   if(context == NULL || key == NULL)
      return ERROR_INVALID_PARAMETER;

   //Invalid key length?
   if(keyLen != 16 && keyLen != 24 && keyLen != 32)
      return ERROR_INVALID_KEY_LENGTH;

   //Copy the key
   osMemcpy(context->ek, key, keyLen);

   //Save the length of the key in bits
   context->nr = keyLen * 8;

   //No error to report
   return NO_ERROR;
}


/**
 * @brief Encrypt a 16-byte block using AES algorithm
 * @param[in] context Pointer to the AES context
 * @param[in] input Plaintext block to encrypt
 * @param[out] output Ciphertext block resulting from encryption
 **/

void aesEncryptBlock(AesContext *context, const uint8_t *input, uint8_t *output)
{
   cau_text_struct text;

   //Specify input and output data
   text.input = (uint8_t *) input;
   text.output = output;
   text.in_length = AES_BLOCK_SIZE;

   //Acquire exclusive access to the CAU module
   osAcquireMutex(&gd32f2xxCryptoMutex);
   //Perform AES encryption
   cau_aes_ecb(CAU_ENCRYPT, (uint8_t *) context->ek, context->nr, &text);
   //Release exclusive access to the CAU module
   osReleaseMutex(&gd32f2xxCryptoMutex);
}


/**
 * @brief Decrypt a 16-byte block using AES algorithm
 * @param[in] context Pointer to the AES context
 * @param[in] input Ciphertext block to decrypt
 * @param[out] output Plaintext block resulting from decryption
 **/

void aesDecryptBlock(AesContext *context, const uint8_t *input, uint8_t *output)
{
   cau_text_struct text;

   //Specify input and output data
   text.input = (uint8_t *) input;
   text.output = output;
   text.in_length = AES_BLOCK_SIZE;

   //Acquire exclusive access to the CAU module
   osAcquireMutex(&gd32f2xxCryptoMutex);
   //Perform AES decryption
   cau_aes_ecb(CAU_DECRYPT, (uint8_t *) context->ek, context->nr, &text);
   //Release exclusive access to the CAU module
   osReleaseMutex(&gd32f2xxCryptoMutex);
}

#endif
#if (ECB_SUPPORT == ENABLED)

/**
 * @brief ECB encryption
 * @param[in] cipher Cipher algorithm
 * @param[in] context Cipher algorithm context
 * @param[in] p Plaintext to be encrypted
 * @param[out] c Ciphertext resulting from the encryption
 * @param[in] length Total number of data bytes to be encrypted
 * @return Error code
 **/

error_t ecbEncrypt(const CipherAlgo *cipher, void *context,
   const uint8_t *p, uint8_t *c, size_t length)
{
   ErrStatus status;
   cau_text_struct text;

   //Initialize status code
   status = SUCCESS;

   //Specify input and output data
   text.input = (uint8_t *) p;
   text.output = c;
   text.in_length = length;

#if (DES_SUPPORT == ENABLED)
   //DES cipher algorithm?
   if(cipher == DES_CIPHER_ALGO)
   {
      //Check the length of the payload
      if(length == 0)
      {
         //No data to process
      }
      else if((length % DES_BLOCK_SIZE) == 0)
      {
         DesContext *desContext;

         //Point to the DES context
         desContext = (DesContext *) context;

         //Acquire exclusive access to the CAU module
         osAcquireMutex(&gd32f2xxCryptoMutex);
         //Perform DES-ECB encryption
         status = cau_des_ecb(CAU_ENCRYPT, (uint8_t *) desContext->ks, &text);
         //Release exclusive access to the CAU module
         osReleaseMutex(&gd32f2xxCryptoMutex);
      }
      else
      {
         //The length of the payload must be a multiple of the block size
         status = ERROR;
      }
   }
   else
#endif
#if (DES3_SUPPORT == ENABLED)
   //Triple DES cipher algorithm?
   if(cipher == DES3_CIPHER_ALGO)
   {
      //Check the length of the payload
      if(length == 0)
      {
         //No data to process
      }
      else if((length % DES3_BLOCK_SIZE) == 0)
      {
         Des3Context *des3Context;

         //Point to the Triple DES context
         des3Context = (Des3Context *) context;

         //Acquire exclusive access to the CAU module
         osAcquireMutex(&gd32f2xxCryptoMutex);
         //Perform 3DES-ECB encryption
         status = cau_tdes_ecb(CAU_ENCRYPT, (uint8_t *) des3Context->k1.ks, &text);
         //Release exclusive access to the CAU module
         osReleaseMutex(&gd32f2xxCryptoMutex);
      }
      else
      {
         //The length of the payload must be a multiple of the block size
         status = ERROR;
      }
   }
   else
#endif
#if (AES_SUPPORT == ENABLED)
   //AES cipher algorithm?
   if(cipher == AES_CIPHER_ALGO)
   {
      //Check the length of the payload
      if(length == 0)
      {
         //No data to process
      }
      else if((length % AES_BLOCK_SIZE) == 0)
      {
         AesContext *aesContext;

         //Point to the AES context
         aesContext = (AesContext *) context;

         //Acquire exclusive access to the CAU module
         osAcquireMutex(&gd32f2xxCryptoMutex);
         //Perform AES-ECB encryption
         status = cau_aes_ecb(CAU_ENCRYPT, (uint8_t *) aesContext->ek,
            aesContext->nr, &text);
         //Release exclusive access to the CAU module
         osReleaseMutex(&gd32f2xxCryptoMutex);
      }
      else
      {
         //The length of the payload must be a multiple of the block size
         status = ERROR;
      }
   }
   else
#endif
   //Unknown cipher algorithm?
   {
      //ECB mode operates in a block-by-block fashion
      while(length >= cipher->blockSize)
      {
         //Encrypt current block
         cipher->encryptBlock(context, p, c);

         //Next block
         p += cipher->blockSize;
         c += cipher->blockSize;
         length -= cipher->blockSize;
      }

      //The length of the payload must be a multiple of the block size
      if(length != 0)
      {
         status = ERROR;
      }
   }

   //Return status code
   return (status == SUCCESS) ? NO_ERROR : ERROR_FAILURE;
}


/**
 * @brief ECB decryption
 * @param[in] cipher Cipher algorithm
 * @param[in] context Cipher algorithm context
 * @param[in] c Ciphertext to be decrypted
 * @param[out] p Plaintext resulting from the decryption
 * @param[in] length Total number of data bytes to be decrypted
 * @return Error code
 **/

error_t ecbDecrypt(const CipherAlgo *cipher, void *context,
   const uint8_t *c, uint8_t *p, size_t length)
{
   ErrStatus status;
   cau_text_struct text;

   //Initialize status code
   status = SUCCESS;

