Oryx-Embedded/CycloneCRYPTO/hardware/gd32f2xx/gd32f2xx_crypto_cipher.c
   //Specify input and output data
   text.input = (uint8_t *) c;
   text.output = p;
   text.in_length = length;

#if (DES_SUPPORT == ENABLED)
   //DES cipher algorithm?
   if(cipher == DES_CIPHER_ALGO)
   {
      //Check the length of the payload
      if(length == 0)
      {
         //No data to process
      }
      else if((length % DES_BLOCK_SIZE) == 0)
      {
         DesContext *desContext;

         //Point to the DES context
         desContext = (DesContext *) context;

         //Acquire exclusive access to the CAU module
         osAcquireMutex(&gd32f2xxCryptoMutex);
         //Perform DES-ECB decryption
         status = cau_des_ecb(CAU_DECRYPT, (uint8_t *) desContext->ks, &text);
         //Release exclusive access to the CAU module
         osReleaseMutex(&gd32f2xxCryptoMutex);
      }
      else
      {
         //The length of the payload must be a multiple of the block size
         status = ERROR;
      }
   }
   else
#endif
#if (DES3_SUPPORT == ENABLED)
   //Triple DES cipher algorithm?
   if(cipher == DES3_CIPHER_ALGO)
   {
      //Check the length of the payload
      if(length == 0)
      {
         //No data to process
      }
      else if((length % DES3_BLOCK_SIZE) == 0)
      {
         Des3Context *des3Context;

         //Point to the Triple DES context
         des3Context = (Des3Context *) context;

         //Acquire exclusive access to the CAU module
         osAcquireMutex(&gd32f2xxCryptoMutex);
         //Perform 3DES-ECB decryption
         status = cau_tdes_ecb(CAU_DECRYPT, (uint8_t *) des3Context->k1.ks, &text);
         //Release exclusive access to the CAU module
         osReleaseMutex(&gd32f2xxCryptoMutex);
      }
      else
      {
         //The length of the payload must be a multiple of the block size
         status = ERROR;
      }
   }
   else
#endif
#if (AES_SUPPORT == ENABLED)
   //AES cipher algorithm?
   if(cipher == AES_CIPHER_ALGO)
   {
      //Check the length of the payload
      if(length == 0)
      {
         //No data to process
      }
      else if((length % AES_BLOCK_SIZE) == 0)
      {
         AesContext *aesContext;

         //Point to the AES context
         aesContext = (AesContext *) context;

         //Acquire exclusive access to the CAU module
         osAcquireMutex(&gd32f2xxCryptoMutex);
         //Perform AES-ECB decryption
         status = cau_aes_ecb(CAU_DECRYPT, (uint8_t *) aesContext->ek,
            aesContext->nr, &text);
         //Release exclusive access to the CAU module
         osReleaseMutex(&gd32f2xxCryptoMutex);
      }
      else
      {
         //The length of the payload must be a multiple of the block size
         status = ERROR;
      }
   }
   else
#endif
   //Unknown cipher algorithm?
   {
      //ECB mode operates in a block-by-block fashion
      while(length >= cipher->blockSize)
      {
         //Decrypt current block
         cipher->decryptBlock(context, c, p);

         //Next block
         c += cipher->blockSize;
         p += cipher->blockSize;
         length -= cipher->blockSize;
      }

      //The length of the payload must be a multiple of the block size
      if(length != 0)
      {
         status = ERROR;
      }
   }

   //Return status code
   return (status == SUCCESS) ? NO_ERROR : ERROR_FAILURE;
}

#endif
#if (CBC_SUPPORT == ENABLED)

/**
 * @brief CBC encryption
 * @param[in] cipher Cipher algorithm
 * @param[in] context Cipher algorithm context
 * @param[in,out] iv Initialization vector
 * @param[in] p Plaintext to be encrypted
 * @param[out] c Ciphertext resulting from the encryption
 * @param[in] length Total number of data bytes to be encrypted
 * @return Error code
 **/

error_t cbcEncrypt(const CipherAlgo *cipher, void *context,
   uint8_t *iv, const uint8_t *p, uint8_t *c, size_t length)
{
   ErrStatus status;
   cau_text_struct text;

   //Initialize status code
   status = SUCCESS;

   //Specify input and output data
   text.input = (uint8_t *) p;
   text.output = c;
   text.in_length = length;

#if (DES_SUPPORT == ENABLED)
   //DES cipher algorithm?
   if(cipher == DES_CIPHER_ALGO)
   {
      //Check the length of the payload
      if(length == 0)
      {
         //No data to process
      }
      else if((length % DES_BLOCK_SIZE) == 0)
      {
         DesContext *desContext;

         //Point to the DES context
         desContext = (DesContext *) context;

         //Acquire exclusive access to the CAU module
         osAcquireMutex(&gd32f2xxCryptoMutex);
         //Perform DES-CBC encryption
         status = cau_des_cbc(CAU_ENCRYPT, (uint8_t *) desContext->ks, iv, &text);
         //Release exclusive access to the CAU module
         osReleaseMutex(&gd32f2xxCryptoMutex);
      }
      else
      {
         //The length of the payload must be a multiple of the block size
         status = ERROR;
      }
   }
   else
#endif
#if (DES3_SUPPORT == ENABLED)
   //Triple DES cipher algorithm?
   if(cipher == DES3_CIPHER_ALGO)
   {
      //Check the length of the payload
      if(length == 0)
      {
         //No data to process
      }
      else if((length % DES3_BLOCK_SIZE) == 0)
      {
         Des3Context *des3Context;

         //Point to the Triple DES context
         des3Context = (Des3Context *) context;

         //Acquire exclusive access to the CAU module
         osAcquireMutex(&gd32f2xxCryptoMutex);
         //Perform 3DES-ECB encryption
         status = cau_tdes_cbc(CAU_ENCRYPT, (uint8_t *) des3Context->k1.ks, iv, &text);
         //Release exclusive access to the CAU module
         osReleaseMutex(&gd32f2xxCryptoMutex);
      }
      else
      {
         //The length of the payload must be a multiple of the block size
         status = ERROR;
      }
   }
   else
#endif
#if (AES_SUPPORT == ENABLED)
   //AES cipher algorithm?
   if(cipher == AES_CIPHER_ALGO)
   {
      //Check the length of the payload
      if(length == 0)
      {
         //No data to process
      }
      else if((length % AES_BLOCK_SIZE) == 0)
      {
         AesContext *aesContext;

         //Point to the AES context
         aesContext = (AesContext *) context;

         //Acquire exclusive access to the CAU module
         osAcquireMutex(&gd32f2xxCryptoMutex);
         //Perform AES-CBC encryption
         status = cau_aes_cbc(CAU_ENCRYPT, (uint8_t *) aesContext->ek,
            aesContext->nr, iv, &text);
         //Release exclusive access to the CAU module
         osReleaseMutex(&gd32f2xxCryptoMutex);
      }
      else
      {
         //The length of the payload must be a multiple of the block size
         status = ERROR;
      }
   }
   else
#endif
   //Unknown cipher algorithm?
   {
      size_t i;

      //CBC mode operates in a block-by-block fashion
      while(length >= cipher->blockSize)
      {
         //XOR input block with IV contents
         for(i = 0; i < cipher->blockSize; i++)
         {
            c[i] = p[i] ^ iv[i];
         }

         //Encrypt the current block based upon the output of the previous
         //encryption
         cipher->encryptBlock(context, c, c);

         //Update IV with output block contents
         osMemcpy(iv, c, cipher->blockSize);

         //Next block
         p += cipher->blockSize;
         c += cipher->blockSize;
         length -= cipher->blockSize;
      }

      //The length of the payload must be a multiple of the block size
      if(length != 0)
      {
         status = ERROR;
      }
   }

   //Return status code
   return (status == SUCCESS) ? NO_ERROR : ERROR_FAILURE;
}


/**
 * @brief CBC decryption
 * @param[in] cipher Cipher algorithm
 * @param[in] context Cipher algorithm context
 * @param[in,out] iv Initialization vector
 * @param[in] c Ciphertext to be decrypted
 * @param[out] p Plaintext resulting from the decryption
 * @param[in] length Total number of data bytes to be decrypted
 * @return Error code
 **/

error_t cbcDecrypt(const CipherAlgo *cipher, void *context,
   uint8_t *iv, const uint8_t *c, uint8_t *p, size_t length)
{
   ErrStatus status;
   cau_text_struct text;

   //Initialize status code
   status = SUCCESS;

